# NeutralSize Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireType..::..NeutralSize Property
WireType Class See Also
---
The maximum neutral size of the wire type.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public NeutralMode NeutralSize { get; set; }
```

Visual Basic
---
```text
Public Property NeutralSize As NeutralMode
	Get
	Set
```

Visual C++
---
```text
public:
property NeutralMode NeutralSize {
	NeutralMode get ();
	void set (NeutralMode value);
}
```

# See Also
WireType Class
Autodesk.Revit.DB.Electrical Namespace